{
  "plugins": {
    "autopairs": {
      "src": "https://github.com/windwp/nvim-autopairs"
    },
    "base16": {
      "src": "https://github.com/RRethy/base16-nvim"
    },
    "blankline": {
      "src": "https://github.com/lukas-reineke/indent-blankline.nvim"
    },
    "bufferline": {
      "src": "https://github.com/akinsho/bufferline.nvim"
    },
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer"
    },
    "cmp-cmdline": {
      "src": "https://github.com/hrsh7th/cmp-cmdline"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path"
    },
    "dashboard": {
      "src": "https://github.com/nvimdev/dashboard-nvim"
    },
    "dressing": {
      "src": "https://github.com/stevearc/dressing.nvim"
    },
    "git-conflict": {
      "src": "https://github.com/akinsho/git-conflict.nvim"
    },
    "gitsigns": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "highlight-colors": {
      "src": "https://github.com/brenoprata10/nvim-highlight-colors"
    },
    "hop": {
      "src": "https://github.com/smoka7/hop.nvim"
    },
    "lazydev": {
      "src": "https://github.com/folke/lazydev.nvim"
    },
    "lspkind": {
      "src": "https://github.com/onsails/lspkind.nvim"
    },
    "lualine": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "luasnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip"
    },
    "markdown-plus": {
      "src": "https://github.com/yousefhadder/markdown-plus.nvim"
    },
    "mason": {
      "src": "https://github.com/williamboman/mason.nvim"
    },
    "mason-lspconfig": {
      "src": "https://github.com/williamboman/mason-lspconfig.nvim"
    },
    "milli": {
      "src": "https://github.com/amansingh-afk/milli.nvim"
    },
    "mini-icons": {
      "src": "https://github.com/nvim-mini/mini.icons"
    },
    "modes": {
      "src": "https://github.com/mvllow/modes.nvim"
    },
    "neo-tree": {
      "src": "https://github.com/nvim-neo-tree/neo-tree.nvim"
    },
    "noice": {
      "src": "https://github.com/folke/noice.nvim"
    },
    "notify": {
      "src": "https://github.com/rcarriga/nvim-notify"
    },
    "nui": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "oil": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "plenary": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "scrollbar": {
      "src": "https://github.com/petertriho/nvim-scrollbar"
    },
    "sllm": {
      "src": "https://github.com/mozanunal/sllm.nvim"
    },
    "smart-splits": {
      "src": "https://github.com/mrjones2014/smart-splits.nvim"
    },
    "snacks": {
      "src": "https://github.com/folke/snacks.nvim"
    },
    "statuscol": {
      "src": "https://github.com/luukvbaal/statuscol.nvim"
    },
    "telescope": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "telescope-fzf-native": {
      "src": "https://github.com/nvim-telescope/telescope-fzf-native.nvim"
    },
    "vim-illuminate": {
      "src": "https://github.com/RRethy/vim-illuminate"
    },
    "vim-matchup": {
      "src": "https://github.com/andymass/vim-matchup"
    },
    "vim-move": {
      "src": "https://github.com/matze/vim-move"
    },
    "vim-suda": {
      "src": "https://github.com/lambdalisue/vim-suda"
    },
    "which-key": {
      "src": "https://github.com/folke/which-key.nvim"
    }
  }
}
